{
  "title": "Apple Spice Pork Chops",
  "slug": "apple-spice-pork-chops",
  "image": "../images/apple-spice-pork-chops.jpg",
  "rating": 7,
  "notes": [
    "cook the apples less"
  ],
  "source": "https://www.budgetbytes.com/apple-spice-pork-chops/",
  "ingredients": [
    "4 pork chops ",
    "2 Tbsp vegetable oil ",
    " Pinch salt and pepper ",
    "1 med onion ",
    "2 fuji apples ",
    "2 Tbsp butter ",
    "1 Tbsp brown sugar ",
    "1/4 tsp cinnamon ",
    "1/8 tsp nutmeg ",
    "1 cup chicken broth"
  ],
  "instructions": [
    "Heat the vegetable oil in a heavy skillet over medium heat. While the skillet is heating, open the pork chops and season each side with a pinch of salt and freshly ground pepper.",
    "Once the oil is hot and shimmering, place the chops in the pan. Cook the chops undisturbed for 5-7 minutes or until the bottoms form a nice brown crust. If your chops are sticking to the pan, that means they have not formed a crust yet. They will “let go” once the crust forms. Flip the chops and cook the second side in the same manner. It should take 5-7 minutes for each side.",
    "While the chops are searing, thinly slice the onion and slice the apples into wedges. Once the chops have browned on both sides, remove them to a clean plate (they do not need to be cooked through at this point). Add the apples, onions, and butter to the skillet and sauté until the onions are softened. Allow the moisture from the apples and onions to dissolve the browned bits from the skillet as they cook.",
    "Add the broth, brown sugar, cinnamon and nutmeg to the skillet with the apples and onions. Stir until everything is combined, then return the chops to the pan, along with any juices that may have collected on the plate. Nestle the chops down in the mixture, making sure some onions and apples are on top of the chops.",
    "Simmer the chops in the apple and onion mixture for about 10 minutes, or until the liquid has reduced by half, the apples are soft, and the pork chops are cooked through. Stir occasionally, moving the apples and onions around so they all have a chance to simmer and soften. Serve each chop with apples, onions and sauce spooned over top."
  ]
}