{
  "title": "Creamy Chicken Fajita Pasta",
  "slug": "creamy-chicken-fajita-pasta",
  "image": "../images/creamy-chicken-fajita-pasta.jpg",
  "rating": 7,
  "notes": [
    "used only half cream cheese, would be better with 4oz"
  ],
  "source": "https://www.budgetbytes.com/2016/06/creamy-chicken-fajita-pasta/",
  "ingredients": [
    "2 tsp chili powder*",
    "1 tsp smoked paprika",
    "1/4 tsp onion powder",
    "1/4 tsp garlic powder",
    "1/4 tsp cumin",
    "1/8 tsp cayenne",
    "1/2 tsp sugar",
    "1/2 tsp salt",
    "1 Tbsp cooking oil",
    "1 boneless skinless chicken breast (about 0.75 lb.)",
    "1 bell pepper",
    "1 yellow onion",
    "15 oz can fire roasted diced tomatoes",
    "4 oz cream cheese",
    "8 oz pasta (any shape)",
    "2 green onions, sliced"
  ],
  "instructions": [
    "Combine the spices for the fajita spice mix in a bowl and set aside. Dice the onion and bell pepper, and cut the chicken breast into 1/2-inch cubes.",
    "Bring a large pot of water to a boil for the pasta. Once boiling, add the pasta and continue to boil until tender (7-10 minutes, or according to the package directions). Drain the pasta in a colander and set it aside until ready to use.",
    "While waiting for the pasta to cook, heat 1 Tbsp cooking oil in a large skillet over medium heat. Once hot, add the cubed chicken and the fajita spice mix. Sauté the chicken and spices until the chicken is cooked through and slightly browned. Remove the chicken from the skillet to a clean bowl.",
    "Add the onion and bell pepper to the skillet and continue to sauté over medium heat just until they begin to soften slightly on the edges and have a little brown color. Add the canned tomatoes (with juices) and the cream cheese. Stir the mixture over medium heat until the cream cheese melts in and forms a creamy sauce with the tomatoes.",
    "Finally, add the cooked and drained pasta and cooked chicken back to the skillet. Stir until everything is evenly combined and coated in creamy sauce. Top with sliced green onions and serve."
  ]
}