{
  "title": "King Ranch Chicken Casserole",
  "slug": "king-ranch-chicken-casserole",
  "image": "../images/king-ranch-chicken-casserole.jpg",
  "rating": 6,
  "notes": [
    "Good, reheats well"
  ],
  "source": "https://www.budgetbytes.com/king-ranch-chicken-casserole/",
  "ingredients": [
    "1 lb. boneless, skinless chicken breast",
    "1 Tbsp  chili powder",
    "1 Tbsp cooking oil",
    "2 Tbsp butter",
    "1 yellow onion",
    "1 green bell pepper",
    "2 Tbsp all-purpose flour",
    "1 cup chicken broth",
    "1 10 oz. can diced tomatoes with green chiles (Rotel)",
    "1/2 cup sour cream",
    "8 oz. cheddar cheese, shredded",
    "5 cups tortilla chip strips*",
    "2 green onions"
  ],
  "instructions": [
    "Place the chicken breasts on a cutting board, cover with plastic wrap, and use a mallet or rolling pin to pound the chicken to an even thickness, about 3/4 to 1-inch thick. Season both sides of the chicken breasts with chili powder.",
    "Heat the cooking oil in a large skillet over medium. Once hot, swirl the oil to coat the surface of the skillet, then add the seasoned chicken breast. Cook the chicken until browned on each side and cooked through, about 5 minutes each side. Remove the chicken to a clean cutting board to cool.",
    "While the chicken is cooking, finely dice the onion and bell pepper, and shred the cheddar cheese. Begin to preheat the oven to 375ºF. ",
    "After removing the chicken from the skillet, add the butter, onion, and bell pepper. Sauté the onion and bell pepper in the butter over medium heat until the onions are soft and translucent.",
    "Add the flour to the skillet with the onion and bell pepper. Continue to sauté for about one minute more, or until the flour coats the bottom of the skillet and turns golden brown.",
    "Add the chicken broth to the skillet and stir to dissolve the flour and any browned bits of chicken from the bottom of the skillet. Allow the broth come up to a simmer, at which point it will thicken to a gravy. Remove the skillet from the heat.",
    "Drain the can of diced tomatoes with green chiles well. Dice the cooked chicken. Stir the chicken and tomatoes into the gravy. ",
    "After stirring the chicken and tomatoes into the gravy, add the sour cream and 1/2 cup of the shredded cheddar, and stir until combined.",
    "Layer a few handfuls of the tortilla chip strips into the bottom of a 9x13-inch or 3 quart casserole dish. Spoon half of the chicken mixture on top of the chips. Layer more tortilla chip strips on top (about half as much as before), then spoon the remaining chicken mixture on top. Finally, add the remaining 1.5 cups of shredded cheddar.",
    "Bake the casserole in the preheated 375ºF oven for 15 minutes or until the cheese is melted and the casserole bubbles around the edges. Sprinkle sliced green onions on top after baking, then serve hot."
  ]
}