{
  "title": "Louisiana Red Beans & Rice",
  "slug": "louisiana-red-beans--rice",
  "image": "../images/louisiana-red-beans--rice.jpg",
  "rating": 6,
  "notes": [
    "Re-made this and turned out pretty good, do this with cornbread next time"
  ],
  "source": "https://www.budgetbytes.com/2010/03/louisiana-red-beans-rice/",
  "ingredients": [
    "1 lb kidney beans, dry ",
    "1 medium yellow onion ",
    "3 stalks celery ",
    "1 large green bell pepper ",
    "1 lb hot sausage (andouille or kielbasa)",
    "1 Tbsp vegetable oil ",
    "4 cloves garlic ",
    "2 whole bay leaves ",
    "1 tsp dried thyme ",
    "1 tsp dried oregano ",
    "3 cubes chicken bouillon ",
    "1 tsp to taste tony chachere’s / cajun seasoning ",
    "6 sliced green onions, garnish",
    "2 cups uncooked long grain rice "
  ],
  "instructions": [
    "The night before cooking, place your beans in a large bowl and cover with double the amount of water. Let soak at room temperature over night. If you forget to do this (like I did), begin with step 1b.",
    "To quick soak your beans, place them in a pot with double the amount of cold water. Bring the pot to a boil with a lid and let boil for 2 minutes. Remove the beans from the heat after two minutes and let sit, tightly covered, for one hour.",
    "While the beans are soaking, slice the sausage. Some people like to quarter the links lengthwise, then slice to yield small triangular bits. Some like to slice them into half moons but I prefer medallions. Saute the sausage in a large pot over medium/high heat until they are cooked through and nicely browned. Remove them from the pot with a slotted spoon (leave the grease) and refrigerate until later.",
    "Clean and dice the onion, celery, green bell pepper and garlic. Add these to the large pot containing the sausage grease and add 1 Tbsp of vegetable oil if needed. Saute the vegetables until they are soft and transparent (about 10 minutes).",
    "Drain the soaking water off of the beans, rinse them then add them to the pot. Also add 7 cups of water, the bullion, bay leaves, thyme and oregano. Stir it all together well and bring to a boil. Reduce the heat slightly (medium) and boil until the beans are soft (without a lid, about one hour). If the mixture gets dry, add more water (mine had plenty but keep an eye on it).",
    "Once the beans are soft, use the back of a large spoon to smash about half of the beans against the side of the pot. This will give the beans a nice thick “creamy” texture. Add the sausage back into the pot and continue to boil the mixture until it is to your desired thickness (without a lid, mine took one more hour). Add Tony Chachere’s or other Cajun seasoning to your liking. The seasoning contains salt so you will probably not need to add that separately.",
    "During the last hour of cooking, prepare the rice. In another large pot, combine two cups of dry rice with 3.5 cups of water. Bring to a boil with a lid then reduce the heat to low and continue to cook until all of the water has absorbed (about 30 minutes).",
    "Serve the beans in a bowl (about 1 cup of beans & sausage) with a pile of rice on top (.5-.75 cups of rice). Top the bowl with some freshly sliced green onions."
  ]
}