{
  "title": "Pastalaya",
  "slug": "pastalaya",
  "image": "../images/pastalaya.jpg",
  "rating": 6,
  "notes": [
    "Added chicken breast, problem is that it doesn't store well because some noodles end up soggy due to sitting in sauce"
  ],
  "source": "https://www.budgetbytes.com/2015/02/pastalaya/",
  "ingredients": [
    "1 Tbsp vegetable oil",
    "1/2 lb smoked sausage (preferably Andouille)",
    "2 cloves garlic",
    "10 oz bag frozen \"seasoning mix\"*",
    "15 oz can diced tomatoes",
    "1/2 Tbsp Creole seasoning**",
    "1/2 tsp oregano",
    "1/2 tsp smoked paprika",
    "1/4 tsp thyme",
    " Freshly cracked pepper",
    "2 cups chicken broth",
    "1 cup water",
    "1 lb penne pasta",
    "2 Tbsp half and half or cream",
    "1/2 bunch fresh parsley",
    "1/2 bunch green onions"
  ],
  "instructions": [
    "Slice the smoked sausage into thin rounds, then cut any larger pieces in half. Add the sausage and vegetable oil to a large pot and cook over medium heat until the sausage is well browned (about 5 minutes).",
    "Mince two cloves of garlic and add them to the pot. Sauté for one minute, or until the garlic is soft and fragrant. Add the bag of frozen seasoning mix and sauté until heated through (3-5 minutes). Add the can of diced tomatoes (with juices), Creole seasoning, oregano, smoked paprika, thyme, freshly cracked pepper (about 20 cranks of a pepper mill), and pasta to the pot. Finally, add the chicken broth and 1 cup of water, and stir until everything is evenly combined.",
    "Place a lid on the pot and turn the heat up to medium-high. Let the pot come to a boil. As soon as it reaches a boil, stir briefly, replace the lid, turn the heat down to low, and let the pot simmer for 10-12 minutes, or until the pasta is tender. Stir the pot once every few minutes as it simmers to prevent the pasta from sticking. Replace the lid as quickly as possible to maintain a simmer. If the mixture still seems soupy at around 8 minutes, let the pot simmer without a lid for the last few minutes. A little bit of thick sauce at the bottom of the pot is perfect.",
    "While the pasta is simmering, chop the parsley and slice the green onions.",
    "Turn off the heat and stir in the half & half or cream. Stir in most of the chopped parsley and green onions, reserving some to sprinkle over top of each bowl. Serve hot."
  ]
}