{
  "title": "Sheet Pan Pesto Chicken Dinner",
  "slug": "sheet-pan-pesto-chicken-dinner",
  "image": "../images/sheet-pan-pesto-chicken-dinner.jpg",
  "rating": 8,
  "notes": [
    "used spring salad mix w/ raspberry vinagrette, primo"
  ],
  "source": "https://www.budgetbytes.com/sheet-pan-pesto-chicken-dinner/",
  "ingredients": [
    "1 lb. baby potatoes",
    "3 Tbsp olive oil, divided",
    "1/2 tsp oregano",
    "3 pinches salt and pepper",
    "1 pint grape tomatoes",
    "2 boneless, skinless chicken breasts (about 1.3 lbs. total)",
    "1/4 cup pesto",
    "4 oz. mozzarella",
    "1/4 lb. spring mix",
    "1/4 cup Caesar dressing"
  ],
  "instructions": [
    "Preheat the oven to 425ºF. Spray or brush a thin layer of oil onto a large sheet pan.",
    "Slice the potatoes into 1/2 to 3/4-inch pieces. Place them in a bowl, add 1 Tbsp olive oil, the oregano, and a pinch of salt and pepper. Toss the potatoes until they are coated in oil and seasoning, then spread them onto half of the sheet pan.",
    "Add the tomatoes to the same bowl used for the potatoes, add another tablespoon of olive oil and another pinch of salt and pepper. Toss the tomatoes until they are coated and spread them out on the other half of the sheet pan.",
    "Roast the potatoes and tomatoes for 20 minutes. While the potatoes and tomatoes are roasting, prepare the chicken. Place the chicken breasts on a cutting board and cover with a sheet of plastic wrap. Use a rolling pin or mallet to pound the chicken until it is an even thickness, about 1/2-inch thick. Slice each chicken breast into two pieces. Place the chicken in the oiled bowl used for the potatoes and tomatoes, add another tablespoon of olive oil and a pinch of salt and pepper. Toss the chicken until it is coated, then set aside.",
    "After roasting for 20 minutes, stir the potatoes and tomatoes, keeping them separate, and then push each to the side slightly, opening the center of the sheet pan for the chicken. Place the chicken on the sheet pan, then return the pan to the oven and roast everything for an additional 20 minutes.",
    "After 20 minutes, use a meat thermometer to make sure your largest piece of chicken has reached 165ºF at its thickest point.",
    "Spread 1 Tbsp pesto over top of each piece of chicken. Slice the mozzarella into thick slices, then place one over each piece of chicken. Change the setting on the oven from bake to broil and return the sheet pan to the oven. Let the chicken broil for 3-5 minutes, or until the cheese is melted and slightly browned. Watch the chicken closely as it broils because it will cook very quickly under the broiler.",
    "Toss the spring mix with the dressing, then divide between four plates. Add one piece of pesto chicken to each plate, then top the chicken with a few of the roasted tomatoes. Divide the roasted potatoes between the four plates, then serve."
  ]
}