{
  "title": "Slow Cooker Chicken Tortilla Soup",
  "slug": "slow-cooker-chicken-tortilla-soup",
  "image": "../images/slow-cooker-chicken-tortilla-soup.jpg",
  "rating": 7,
  "notes": [
    ""
  ],
  "source": "https://www.budgetbytes.com/slow-cooker-chicken-tortilla-soup/",
  "ingredients": [
    "1 yellow onion",
    "2  cloves garlic",
    "3/4 lb. boneless, skinless chicken breast",
    "1/2 Tbsp chili powder *",
    "1/2 tsp cumin",
    "1/2 tsp smoked paprika",
    "1/4 tsp cayenne (optional)",
    " cracked pepper",
    "1 15oz. can fire roasted tomatoes",
    "1 10oz. can diced tomatoes with green chiles",
    "1 15oz. can black beans",
    "1 cup frozen corn kernels",
    "6 cups chicken broth**",
    "8 6-inch corn tortillas",
    "1 Tbsp  cooking oil",
    "pinch salt",
    "1 avocado",
    "1/4 bunch cilantro",
    "6 Tbsp sour cream",
    "1 lime"
  ],
  "instructions": [
    "Dice the onion and mince the garlic. Add the onion, garlic, chicken breast, chili powder, cumin, smoked paprika, cayenne, some freshly cracked pepper (about 10 cranks of a pepper mill), the fire roasted tomatoes (with juices), diced tomatoes with chiles (with juices), black beans (drained), corn, and chicken broth to the slow cooker.",
    "Give everything a brief stir, place the lid on the slow cooker, and cook on high for 4 hours, or low for 8 hours.",
    "After cooking on high for 4 hours or low for 8 hours, carefully remove the chicken breast, shred it with a fork, then return it to the soup.",
    "To make the tortilla crisps, preheat the oven to 400ºF. Stack the tortillas, then slice them into strips that are approximately 1/4-inch wide and 2 to 3-inches long. Place the strips in a bowl, drizzle with cooking oil, and a pinch of salt. Gently toss the strips until they're completely coated in oil.",
    "Spread the oil coated tortilla strips over a baking sheet in a single layer, overlapping as little as possible. Bake them in the preheated oven for 10-15 minutes, stirring once every five minutes, or until they are deeply golden brown and crispy. The total cook time will depend on the size of your strips and how crowded they are on the baking sheet, so watch them closely and adjust the cook time as needed.",
    "To serve, ladle the soup into bowls, top with a handful of the tortilla crisps, some chopped cilantro, a few slices of avocado, and a dollop of sour cream. Squeeze a wedge of fresh lime over top just before eating."
  ]
}