{
    "title": "Slow Cooker Creamy Tortellini Soup",
    "rating": 8,
    "notes": [
        ""
    ],
    "source": "https://cafedelites.com/slow-cooker-creamy-tortellini-soup/",
    "image": "../images/slow-cooker-creamy-tortellini-soup.jpg",
    "slug": "slow-cooker-creamy-tortellini-soup",
    "ingredients": [
        "1 pound (500 g) ground Italian sausage (or ground chicken, turkey or beef), browned*",
        "1 onion, chopped",
        "2 large carrots, chopped",
        "2 stalks celery, chopped",
        "4 cloves garlic, minced",
        "1 tablespoon Italian seasoning",
        "2 teaspoon beef bouillon powder (or chicken)",
        "1/2 teaspoon salt",
        "4 cups beef broth (or chicken or vegetable broth -- I use low sodium)",
        "1/4 cup cornstarch mixed and dissolved in 1/4 cup water",
        "36 ounces evaporated milk or half and half",
        "12 ounce packet three cheese tortellini (I used dried not fresh; choose any flavour you like)",
        "5 cups fresh baby spinach",
        "1 cup milk"
    ],
    "instructions": [
        "Place the browned sausage, onion, carrots, celery, garlic, Italian seasoning, beef bouillon powder, salt, and broth in a 6-quart / litre slow cooker bowl. Cover and cook on high for 4 hours or low for 7 hours.",
        "Uncover and skim any fat that is sitting on the top of the soup with a spoon; discard. Stir in the cornstarch mixture with the evaporated milk (or half and half or cream). Add the tortellini and mix well. Cover again and cook on HIGH heat setting for a further 45 minutes until the soup has thickened, and the tortellini is soft and cooked through.",
        "Add in the spinach, pressing the leaves down to completely submerse into the liquid. Cover again for a further 5-10 minutes until the leaves have wilted.",
        "Pour in milk in 1/3 cup increments, as needed, to reach your desired thickness and consistency (I needed 1 cup); taste test and season with extra salt ONLY if needed, and pepper to suit your tastes.",
        "Serve with crusty warmed bread"
    ]
}